app/controllers/api/v1/users_controller.rb

  def create
    @user = User.create(username: params[:username], password: params[:password], firstname: params[:firstname], lastname: params[:lastname] )
---
INSERT INTO "users" ("username", "firstname", "lastname", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"